var city={
    '直辖市':["北京","天津","上海","重庆","香港","澳门"],
    '北京':["昌平区", "朝阳区", "崇文区", "大兴区", "东城区", "房山区", "丰台区", "海淀区", "怀柔区", "门头沟区", "平谷区", "石景山区", "顺义区", "通州区", "西城区", "宣武区"],
    '天津':["和平区", "河东区", "河西区", "南开区", "河北区", "红桥区","塘沽区","汉沽区","大港区","东丽区","西青区","北辰区","津南区","武清区","宝坻区"],
   '上海':["黄浦区","卢湾区","徐汇区","长宁区","静安区","普陀区","闸北区","虹口区","杨浦区","浦东新区","宝山区","嘉定区","闵行区","松江区","青浦区","金山区","南汇区","奉贤区"],
    '重庆':["渝中区","江北区","南岸区","沙坪坝区","九龙坡区","大渡口区","渝北区","巴南区","北碚区","永川区","涪陵区","长寿区","江津区","合川区","双桥区","万盛区","南川区","万州区","黔江区"],
    '香港':["香港"],
    '澳门':["澳门"],
   '河北':["石家庄","唐山","秦皇岛","邯郸","邢台","保定","张家口","承德","沧州","廊坊","衡水"],
    '山西':["太原","大同","阳泉","长治","晋城","朔州","晋中","运城","忻州","临汾","吕梁"],
    '内蒙古':["呼和浩特","包头","乌海","赤峰","通辽","鄂尔多斯","呼伦贝尔","巴彦淖尔","乌兰察布","兴安","锡林郭勒","阿拉善"],
    '辽宁':["沈阳","大连","鞍山","抚顺","本溪","丹东","锦州","营口","阜新","辽阳","盘锦","铁岭","朝阳","葫芦岛"],
    '吉林':["长春","吉林","四平","辽源","通化","白山","松原","白城","延边"],
    '黑龙江':["哈尔滨","齐齐哈尔","鸡西","鹤岗","双鸭山","大庆","伊春","佳木斯","七台河","牡丹江","黑河","绥化","大兴安岭"],
    '江苏':["南京","苏州","扬州","无锡","徐州","常州","南通","连云港","淮安","盐城","镇江","泰州","宿迁"],
    '浙江':["杭州","宁波","温州","嘉兴","湖州","绍兴","金华","衢州","舟山","台州","丽水"],
    '安徽':["合肥","芜湖","蚌埠","淮南","马鞍山","淮北","铜陵","安庆","黄山","滁州","阜阳","宿州","巢湖","六安","亳州","池州","宣城"],
    '福建':["福州","宁德","南平","厦门","莆田","三明","泉州","漳州"],
    '江西':["南昌","上饶","萍乡","九江","景德镇","新余","鹰潭","赣州","吉安","宜春","抚州"],
    '山东':["济南","青岛","淄博","枣庄","东营","烟台","潍坊","威海","济宁","泰安","日照","莱芜","临沂","德州","聊城","滨州","菏泽"],
    '河南':["郑州","开封","洛阳","平顶山","焦作","鹤壁","新乡","安阳","濮阳","漯河","许昌","三门峡","南阳","商丘","信阳","周口","驻马店"],
    '湖北':["武汉","十堰","襄樊","鄂州","黄石","荆州","宜昌","荆门","孝感","黄冈","咸宁","随州","恩施"],
    '湖南':["长沙","株洲","湘潭","岳阳","邵阳","常德","衡阳","张家界","益阳","郴州","永州","怀化","娄底","湘西"],
    '广东':["广州","清远","潮州","东莞","珠海","深圳","汕头","韶关","佛山","江门","湛江","茂名","肇庆","惠州","梅州","汕尾","阳江","河源","中山","揭阳","云浮"],
    '广西':["南宁","柳州","桂林","梧州","北海","防城港","钦州","贵港","玉林","百色","贺州","河池","来宾","崇左"],
    '海南':["海口","三亚"],
    '四川':["成都","自贡","攀枝花","泸州","德阳","绵阳","广元","遂宁","内江","乐山","南充","宜宾","广安","达州","眉山","雅安","巴中","资阳","阿坝","甘孜","凉山"],
    '贵州':["贵阳","六盘水","遵义","安顺","铜仁","毕节","黔西南","黔东南","黔南"],
    '云南':["昆明","曲靖","玉溪","保山","昭通","丽江","普洱","临沧","文山","红河","西双版纳","楚雄","大理","德宏","怒江","迪庆"],
    '西藏':["拉萨","昌都","山南","日喀则","那曲","阿里","林芝"],
    '陕西': ["西安","铜川","宝鸡","咸阳","渭南","延安","汉中","榆林","安康","商洛"],
    '甘肃': ["兰州","白银","定西","敦煌","嘉峪关","金昌","天水","武威","张掖","平凉","酒泉","庆阳","临夏","陇南","甘南"],
    '青海':["西宁","海东","海北","黄南","海南","果洛","玉树","海西"],
    '宁夏':["银川","石嘴山","吴忠","固原","中卫"],
    '新疆':["乌鲁木齐","克拉玛依","吐鲁番","哈密","和田","阿克苏","喀什","克孜勒苏柯尔克孜","巴音郭楞蒙古","昌吉","博尔塔拉蒙古","伊犁哈萨克","阿勒泰"],
    '台湾':["台北","高雄","基隆","台中","台南","新竹","嘉义"]
}
console.log($('#province'))
$('#province').html('<option value="省份" selected="selected">省份</option>'+
   ' <option value="北京">北京</option>'+
    ' <option value="上海">上海</option>'+
    ' <option value="天津">天津</option>'+
    ' <option value="重庆">重庆</option>'+
    '<option value="河北">河北</option>'+
'<option value="山西">山西</option>'+
    '<option value="内蒙古">内蒙古</option>'+
'<option value="辽宁">辽宁</option>'+
    '<option value="吉林">吉林</option>'+
'<option value="黑龙江">黑龙江</option>'+
    '<option value="江苏">江苏</option>'+
'<option value="浙江">浙江</option>'+
    '<option value="安徽">安徽 </option>'+
'<option value="福建">福建 </option>'+
    '<option value="江西">江西</option>'+
'<option value="山东">山东</option>'+
    '<option value="河南">河南</option>'+
'<option value="湖北">湖北</option>'+
   ' <option value="湖南">湖南</option>'+
'<option value="广东">广东</option>'+
    '<option value="广西">广西</option>'+
'<option value="海南">海南</option>'+
    '<option value="四川">四川</option>'+
'<option value="贵州">贵州</option>'+
    '<option value="云南">云南</option>'+
'<option value="西藏">西藏</option>'+
    '<option value="陕西">陕西 </option>'+
'<option value="甘肃">甘肃 </option>'+
    '<option value="青海">青海</option>'+
'<option value="宁夏">宁夏</option>'+
    '<option value="新疆">新疆</option>'+
    '<option value="香港">香港</option>'+
    '<option value="澳门">澳门</option>'+
'<option value="台湾">台湾</option>   ') ;

$('#city').html('<option value="市/区" selected="selected">市/区</option>')
$('#province').change(function(){
    var defaultCity=''
    var index=$(this).val();
    if(index=='省份') {
        defaultCity='<option value="市/区" selected="selected">市/区</option>' ;
        $('#city').html(defaultCity);
        return false;
    }

    var cityArr=city[index];
    defaultCity='<option value="市/区" selected="selected">市/区</option>'
    for(var i=0;i<cityArr.length;i++){
        defaultCity+='<option value="'+cityArr[i]+'">'+cityArr[i]+'</option>'
    }
    if(index=='省份') defaultCity='<option value="市/区" selected="selected">市/区</option>'
    $('#city').html(defaultCity)
})